
# GeekBrains-MySQL
Lessons MySQL

Здесь, я отвечу на вопросы домашнего задания.

1) Какие у вас ожидания от курса? Есть ли конкретные вопросы по теме Базы данных?
А) Ожидания от курса:
- научиться разворачиваться и размечать БД
- работать не просто с БД на уровне CMS -> БД, а БД с 0 к самопису.

2) В какой сфере работаете сейчас?
Маркетинг, проектирование (создание структур и придумывание проектов) систем

3) Если в IT, то какой у вас опыт (инструменты, технологии, языки программирования)?
В технической части работал только с готовым - разворачивал сайты на готовых CMS, прмавил html.


Общая информация. Никому не нужны общие понятия и не нужные инструменты такие как строка ввода или терминал.
Нужно использовать и показывать программы, а лучше 1 конкретную для всех.

Кстати, очень тяжело всегда учиться, если учитель использует разные ОСИ в процессе обучения и программы.
Думаю, что стоит голосования устраивать перед началось, на чем же все же показывать.